<?php

namespace App\Http\Controllers\Main;

use App\Http\Controllers\Controller;
use Illuminate\Http\Request;

class MainController extends Controller
{
    public function index()
    {
        return view('main.contact.index');
    }
    public function about()
    {
        return view('main.about.index');
    }
    public function courses()
    {
        $courses = [
            'Автокара ҳайдовчилари',
            'Автомобилларга техник хизмат кўрсатиш бўйича техник-механиклар',
            'Сварщики (Аргонодуговая)',
            'Аттракционларда ишловчи механик, оператор-ўрнаштирувчилар',
            'Баландликда (Юкорида) ишловчилар',
            'Автотранспорт ҳайдовчиларининг Меҳнат муҳофазаси, техника ва йўл ҳаракат хавфсизлиги',
            'Босим остида ишловчи идишлар билан ишловчилар ва жавобгар шахслар',
            'Нефт ва газ қудуқларини бурғуловчилари',
            'Машинист дизелистлар',
            'ИТР и работники АЗС, АГЗС, АГНКС',
            'Нефт ва газ саноати корхоналари мухандислари',
            'Қозонхона машинистлари, жавобгар шахслар',
            'Барча турдаги кранлар машинистлари',
            'Қурувчилар',
            'Лифтёров',
            'ММваТХ',
            'Ошпазлар',
            'ПДК (Доимий Ҳаракатдаги Комиссия)',
            'Нефт ва газ қудуқларини бурғуловчи ёрдамчиси',
            'Созловчи(слесарь)лар',
            'Трактор (экскаватор, бульдозер, фронталь юклагич) ҳайдовчилари',
            'Хавфли юк ташувчи автомашина ҳайдовчилари',
            'Электргазпайвандловчилар',
            'Электрик (электр монтажчи, электр созловчи) лар',
            'Юк илдирувчилар',
            'Слесарь по КИПиА',
            'Правила безопасности в газовом хозяйстве',
            'Машинистов компрессорных установ',
            'Правила устройства и безопасной эксплуатации сосудов, работающих под давлением',
            'Пожарно-технический минимум для руководителей, специалистов и лиц, ответственных за пожарную безопасность',
            'Слесари   по   ремонту  и   обслуживанию   технологических   установок',
            'Правила устройства и безопасной эксплуатации факельных систем'
        ];
        return view('main.courses.index', compact('courses'));
    }
}
